tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "libxml2"
brew "glib"
brew "readline"
brew "sqlite"
brew "gdbm"
brew "openssl"
brew "coreutils"
brew "git"
brew "wget"
brew "curl"
brew "cmake"
brew "autoconf"
brew "automake"
brew "pkg-config"
brew "ctags"
brew "tree"
brew "nkf"
brew "sha2"
brew "freetype"
brew "ffmpeg"
# brew "neovim"
brew "docker"
brew "docker-compose"
# brew "rust"
brew "node"

cask "iterm2"
cask "google-chrome"
cask "google-japanese-ime"
cask "xquartz"
cask "alfred"
cask "caffeine"
cask "clipy"
cask "dropbox"
cask "appcleaner"
cask "imageoptim"
cask "visual-studio-code"
cask "font-ricty-diminished"
cask "1password"
cask "arduino"
cask "discord"
cask "docker"
cask "drawio"
cask "spotify"
cask "vlc"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "parallels16"
cask "zoomus"

mas "Slack", id: 803453959
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "The Unarchiver", id: 425424353
mas "CotEditor", id: 1024640650
